pascal-4.0/tutorials/incompressible/pimpleEddyCurrentFoam/tubafSi2Daxi/constant/edgeBiotSavartProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      edgeBiotSavartProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nNonOrthogonalCorrectors    10;

inductors
{
    coil0
    {
        file       "coil0.eMesh";
        reverse    false;
        current    10.2137646171;
        filaments  36;
        phase      0.0;
    }
    
    coil1
    {
        file       "coil1.eMesh";
        reverse    false;
        current    10.2137646171;
        filaments  36;
        phase      0.0;
    }
    
    coil2
    {
        file       "coil2.eMesh";
        reverse    false;
        current    10.2137646171;
        filaments  36;
        phase      0.0;
    }
    
    coil3
    {
        file       "coil3.eMesh";
        reverse    false;
        current    10.2137646171;
        filaments  36;
        phase      0.0;
    }
    
    coil4
    {
        file       "coil4.eMesh";
        reverse    false;
        current    10.2137646171;
        filaments  36;
        phase      0.0;
    }
    
    coil5
    {
        file       "coil5.eMesh";
        reverse    false;
        current    10.2137646171;
        filaments  36;
        phase      0.0;
    }
    
    coil6
    {
        file       "coil6.eMesh";
        reverse    false;
        current    10.2137646171;
        filaments  36;
        phase      0.0;
    }
    
    coil7
    {
        file       "coil7.eMesh";
        reverse    false;
        current    10.2137646171;
        filaments  36;
        phase      0.0;
    }
    
    coil8
    {
        file       "coil8.eMesh";
        reverse    false;
        current    10.2137646171;
        filaments  36;
        phase      0.0;
    }
    
    coil9
    {
        file       "coil9.eMesh";
        reverse    false;
        current    10.2137646171;
        filaments  36;
        phase      0.0;
    }
}

// ************************************************************************* //

