pascal-4.0/tutorials/incompressible/pimpleEddyCurrentFoam/tubafSi2Daxi/constant/region_fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel        Newtonian;

nu                    nu  [ 0 2 -1 0 0 0 0 ] 3.3858268e-7; // SiLiquid
rho                   rho [ 1 -3  0 0 0 0 0 ] 2580;        // SiLiquid

// ************************************************************************* //

