pascal-4.0/tutorials/incompressible/pimpleEddyCurrentFoam/tubafSi2Daxi/system/region_conductor/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                           none;
}

gradSchemes
{
    default                           none;

    curl(A0Re)                        leastSquares;
    curl(A0Im)                        leastSquares;

    grad(A0Re)                        Gauss linear;
    grad(A0Im)                        Gauss linear;

//     grad(sigma)                       Gauss linear;
//     grad(sigma)                       Gauss harmonic;

//     grad(VRe)                         Gauss linear;
//     grad(VIm)                         Gauss linear;
    grad(VRe)                         electricPotentialGrad Gauss sigma ddtAImPhi;
    grad(VIm)                         electricPotentialGrad Gauss sigma ddtARePhi;
}

divSchemes
{
    default                           none;
}

laplacianSchemes
{
    default                           none;

    laplacian(A0Re)                   Gauss linear corrected;
    laplacian(A0Im)                   Gauss linear corrected;

//     laplacian(sigma,VRe)              Gauss linear corrected;
//     laplacian(sigma,VIm)              Gauss linear corrected;
//     laplacian(sigma,VRe)              Gauss linear uncorrected;
//     laplacian(sigma,VIm)              Gauss linear uncorrected;
    laplacian(sigma,VRe)              electricPotentialLaplacian Gauss ddtAImPhi;
    laplacian(sigma,VIm)              electricPotentialLaplacian Gauss ddtARePhi;

}

interpolationSchemes
{
    default                           none;

    interpolate(A0Re)                 linear;
    interpolate(A0Im)                 linear;

    interpolate(grad(A0Re))           linear;
    interpolate(grad(A0Im))           linear;

    interpolate(grad(VRe))            linear;
    interpolate(grad(VIm))            linear;

    interpolate(ARe)                  linear;
    interpolate(AIm)                  linear;
}

// ************************************************************************* //
