pascal-4.0/tutorials/incompressible/pimpleEddyCurrentFoam/tubafSi2Daxi/system/region_static/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        topWall
        {
            type            directMappedWall;
            sampleMode      nearestPatchFace;
            sampleRegion    region_fluid;
            samplePatch     topWall;
            offset          (0 0 0);
        }

        sideWall
        {
            type            directMappedWall;
            sampleMode      nearestPatchFace;
            sampleRegion    region_fluid;
            samplePatch     sideWall;
            offset          (0 0 0);
        }

        cornerWall
        {
            type            directMappedWall;
            sampleMode      nearestPatchFace;
            sampleRegion    region_fluid;
            samplePatch     cornerWall;
            offset          (0 0 0);
        }

        bottomWall
        {
            type            directMappedWall;
            sampleMode      nearestPatchFace;
            sampleRegion    region_fluid;
            samplePatch     bottomWall;
            offset          (0 0 0);
        }
    }
}

// ************************************************************************* //
